Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: فأسر بعبادي ليلا إنكم متبعون
en: Then (his Lord commanded): Take away My slaves by night. Lo! ye will be followed,

source: واترك البحر رهوا إنهم جند مغرقون
en: And leave the sea behind at rest, for lo! they are a drowned host.

source: كم تركوا من جنات وعيون
en: How many were the gardens and the watersprings that they left behind,

source: وزروع ومقام كريم
en: And the cornlands and the goodly sites

source: ونعمة كانوا فيها فاكهين
en: And pleasant things wherein they took delight!

source: كذلك وأورثناها قوما آخرين
en: Even so (it was), and We made it an inheritance for other folk;

source: فما بكت عليهم السماء والأرض وما كانوا منظرين
en: And the heaven and the earth wept not for them, nor were they reprieved.

source: ولقد نجينا بني إسرائيل من العذاب المهين
en: And We delivered the Children of Israel from the shameful doom;

source: من فرعون إنه كان عاليا من المسرفين
en: (We delivered them) from Pharaoh. Lo! he was a tyrant of the wanton ones.

source: ولقد اخترناهم على علم على العالمين
en: And We chose them, purposely, above (all) creatures.

source: وآتيناهم من الآيات ما فيه بلاء مبين
en: And We gave them portents wherein was a clear trial.

source: إن هؤلاء ليقولون
en: Lo! these, forsooth, are saying:

source: إن هي إلا موتتنا الأولى وما نحن بمنشرين
en: There is naught but our first death, and we shall not be raised again.

source: فأتوا بآبائنا إن كنتم صادقين
en: Bring back our fathers, if ye speak the truth!

source: أهم خير أم قوم تبع والذين من قبلهم أهلكناهم إنهم كانوا مجرمين
en: Are they better, or the folk of Tubb'a and those before them? We destroyed them, for surely they were guilty.

source: وما خلقنا السماوات والأرض وما بينهما لاعبين
en: And We created not the heavens and the earth, and all that is between them, in play.

source: ما خلقناهما إلا بالحق ولكن أكثرهم لا يعلمون
en: We created them not save with truth; but most of them know not.

source: إن يوم الفصل ميقاتهم أجمعين
en: Assuredly the Day of Decision is the term for all of them,

source: يوم لا يغني مولى عن مولى شيئا ولا هم ينصرون
en: A day when friend can in naught avail friend, nor can they be helped,

source: إلا من رحم الله إنه هو العزيز الرحيم
en: Save him on whom Allah hath mercy. Lo! He is the Mighty, the Merciful.

source: إن شجرت الزقوم
en: Lo! the tree of Zaqqum,

source: طعام الأثيم
en: The food of the sinner!

source: كالمهل يغلي في البطون
en: Like molten brass, it seetheth in their bellies

source: كغلي الحميم
en: As the seething of boiling water.

source: خذوه فاعتلوه إلى سواء الجحيم
en: (And it will be said): Take him and drag him to the midst of hell,

source: ثم صبوا فوق رأسه من عذاب الحميم
en: Then pour upon his head the torment of boiling water.

source: ذق إنك أنت العزيز الكريم
en: (Saying): Taste! Lo! thou wast forsooth the mighty, the noble!

source: إن هذا ما كنتم به تمترون
en: Lo! this is that whereof ye used to doubt.

source: إن المتقين في مقام أمين
en: Lo! those who kept their duty will be in a place secured.

source: يلبسون من سندس وإستبرق متقابلين
en: Attired in silk and silk embroidery, facing one another.

source: كذلك وزوجناهم بحور عين
en: Even so (it will be). And We shall wed them unto fair ones with wide, lovely eyes.

source: يدعون فيها بكل فاكهة آمنين
en: They call therein for every fruit in safety.

source: لا يذوقون فيها الموت إلا الموتة الأولى ووقاهم عذاب الجحيم
en: They taste not death therein, save the first death. And He hath saved them from the doom of hell,

source: فضلا من ربك ذلك هو الفوز العظيم
en: A bounty from thy Lord. That is the supreme triumph.

source: فإنما يسرناه بلسانك لعلهم يتذكرون
en: And We have made (this Scripture) easy in thy language only that they may heed.

source: فارتقب إنهم مرتقبون
en: Wait then (O Muhammad). Lo! they (too) are waiting.

source: إن في السماوات والأرض لآيات للمؤمنين
en: Lo! in the heavens and the earth are portents for believers.

source: وفي خلقكم وما يبث من دابة آيات لقوم يوقنون
en: And in your creation, and all the beasts that He scattereth in the earth, are portents for a folk whose faith is sure.

source: واختلاف الليل والنهار وما أنزل الله من السماء من رزق فأحيا به الأرض بعد موتها وتصريف الرياح آيات لقوم يعقلون
en: And the difference of night and day and the provision that Allah sendeth down from the sky and thereby quickeneth the earth after her death, and the ordering of the winds, are portents for a people who have sense.

source: تلك آيات الله نتلوها عليك بالحق فبأي حديث بعد الله وآياته يؤمنون
en: These are the portents of Allah which We recite unto thee (Muhammad) with truth. Then in what fact, after Allah and His portents, will they believe?

source: ويل لكل أفاك أثيم
en: Woe unto each sinful liar,

source: يسمع آيات الله تتلى عليه ثم يصر مستكبرا كأن لم يسمعها فبشره بعذاب أليم
en: Who heareth the revelations of Allah recited unto him, and then continueth in pride as though he heard them not. Give him tidings of a painful doom.

source: وإذا علم من آياتنا شيئا اتخذها هزوا أولئك لهم عذاب مهين
en: And when he knoweth aught of Our revelations he maketh it a jest. For such there is a shameful doom.

source: من ورائهم جهنم ولا يغني عنهم ما كسبوا شيئا ولا ما اتخذوا من دون الله أولياء ولهم عذاب عظيم
en: Beyond them there is hell, and that which they have earned will naught avail them, nor those whom they have chosen for protecting friends beside Allah. Theirs will be an awful doom.

source: هذا هدى والذين كفروا بآيات ربهم لهم عذاب من رجز أليم
en: This is guidance. And those who disbelieve the revelations of their Lord, for them there is a painful doom of wrath.

source: الله الذي سخر لكم البحر لتجري الفلك فيه بأمره ولتبتغوا من فضله ولعلكم تشكرون
en: Allah it is Who hath made the sea of service unto you that the ships may run thereon by His command, and that ye may seek of His bounty, and that haply ye may be thankful;

source: وسخر لكم ما في السماوات وما في الأرض جميعا منه إن في ذلك لآيات لقوم يتفكرون
en: And hath made of service unto you whatsoever is in the heavens and whatsoever is in the earth; it is all from Him. Lo! herein verily are portents for a people who reflect.

source: قل للذين آمنوا يغفروا للذين لا يرجون أيام الله ليجزي قوما بما كانوا يكسبون
en: Tell those who believe to forgive those who hope not for the days of Allah; in order that He may requite folk what they used to earn.

source: من عمل صالحا فلنفسه ومن أساء فعليها ثم إلى ربكم ترجعون
en: Whoso doeth right, it is for his soul, and whoso doeth wrong, it is against it. And afterward unto your Lord ye will be brought back.

source: ولقد آتينا بني إسرائيل الكتاب والحكم والنبوة ورزقناهم من الطيبات وفضلناهم على العالمين
en: And verily we gave the Children of Israel the Scripture and the Command and the Prophethood, and provided them with good things and favoured them above (all) peoples;

source: وآتيناهم بينات من الأمر فما اختلفوا إلا من بعد ما جاءهم العلم بغيا بينهم إن ربك يقضي بينهم يوم القيامة فيما كانوا فيه يختلفون
en: And gave them plain commandments. And they differed not until after the knowledge came unto them, through rivalry among themselves. Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.

source: ثم جعلناك على شريعة من الأمر فاتبعها ولا تتبع أهواء الذين لا يعلمون
en: And now have We set thee (O Muhammad) on a clear road of (Our) commandment; so follow it, and follow not the whims of those who know not.

source: إنهم لن يغنوا عنك من الله شيئا وإن الظالمين بعضهم أولياء بعض والله ولي المتقين
en: Lo! they can avail thee naught against Allah. And lo! as for the wrong-doers, some of them are friends of others; and Allah is the Friend of those who ward off (evil).

source: هذا بصائر للناس وهدى ورحمة لقوم يوقنون
en: This is clear indication for mankind, and a guidance and a mercy for a folk whose faith is sure.

source: أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون
en: Or do those who commit ill-deeds suppose that We shall make them as those who believe and do good works, the same in life and death? Bad is their judgment!

source: وخلق الله السماوات والأرض بالحق ولتجزى كل نفس بما كسبت وهم لا يظلمون
en: And Allah hath created the heavens and the earth with truth, and that every soul may be repaid what it hath earned. And they will not be wronged.

source: أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة فمن يهديه من بعد الله أفلا تذكرون
en: Hast thou seen him who maketh his desire his god, and Allah sendeth him astray purposely, and sealeth up his hearing and his heart, and setteth on his sight a covering? Then who will lead him after Allah (hath condemned him)? Will ye not then heed?

source: وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا وما يهلكنا إلا الدهر وما لهم بذلك من علم إن هم إلا يظنون
en: And they say: There is naught but our life of the world; we die and we live, and naught destroyeth us save time; when they have no knowledge whatsoever of (all) that; they do but guess.

source: وإذا تتلى عليهم آياتنا بينات ما كان حجتهم إلا أن قالوا ائتوا بآبائنا إن كنتم صادقين
en: And when Our clear revelations are recited unto them their only argument is that they say: Bring (back) our fathers. then, if ye are truthful.

source: قل الله يحييكم ثم يميتكم ثم يجمعكم إلى يوم القيامة لا ريب فيه ولكن أكثر الناس لا يعلمون
en: Say (unto them, O Muhammad): Allah giveth life to you, then causeth you to die, then gathereth you unto the Day of Resurrection whereof there is no doubt. But most of mankind know not.

source: ولله ملك السماوات والأرض ويوم تقوم الساعة يومئذ يخسر المبطلون
en: And unto Allah belongeth the Sovereignty of the heavens and the earth; and on the day when the Hour riseth, on that day those who follow falsehood will be lost.

source: وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون
en: And thou wilt see each nation crouching, each nation summoned to its record. (And it will be said unto them): This day ye are requited what ye used to do.

source: هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون
en: This Our Book pronounceth against you with truth. Lo! We have caused (all) that ye did to be recorded.

source: فأما الذين آمنوا وعملوا الصالحات فيدخلهم ربهم في رحمته ذلك هو الفوز المبين
en: Then, as for those who believed and did good works, their Lord will bring them in unto His mercy. That is the evident triumph.

source: وأما الذين كفروا أفلم تكن آياتي تتلى عليكم فاستكبرتم وكنتم قوما مجرمين
en: And as for those who disbelieved (it will be said unto them): Were not Our revelations recited unto you? But ye were scornful and became a guilty folk.

source: وإذا قيل إن وعد الله حق والساعة لا ريب فيها قلتم ما ندري ما الساعة إن نظن إلا ظنا وما نحن بمستيقنين
en: And when it was said: Lo! Allah's promise is the truth, and there is no doubt of the Hour's coming, ye said: We know not what the Hour is. We deem it naught but a conjecture, and we are by no means convinced.

source: وبدا لهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: And the evils of what they did will appear unto them, and that which they used to deride will befall them.

source: وقيل اليوم ننساكم كما نسيتم لقاء يومكم هذا ومأواكم النار وما لكم من ناصرين
en: And it will be said: This day We forget you, even as ye forgot the meeting of this your day; and your habitation is the Fire, and there is none to help you.

source: ذلكم بأنكم اتخذتم آيات الله هزوا وغرتكم الحياة الدنيا فاليوم لا يخرجون منها ولا هم يستعتبون
en: This, forasmuch as ye made the revelations of Allah a jest, and the life of the world beguiled you. Therefor this day they come not forth from thence, nor can they make amends.

source: فلله الحمد رب السماوات ورب الأرض رب العالمين
en: Then praise be to Allah, Lord of the heavens and Lord of the earth, the Lord of the Worlds.

source: وله الكبرياء في السماوات والأرض وهو العزيز الحكيم
en: And unto Him (alone) belongeth Majesty in the heavens and the earth, and He is the Mighty, the Wise.

source: ما خلقنا السماوات والأرض وما بينهما إلا بالحق وأجل مسمى والذين كفروا عما أنذروا معرضون
en: We created not the heavens and the earth and all that is between them save with truth, and for a term appointed. But those who disbelieve turn away from that whereof they are warned.

source: قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات ائتوني بكتاب من قبل هذا أو أثارة من علم إن كنتم صادقين
en: Say (unto them, O Muhammad): Have ye thought on all that ye invoke beside Allah? Show me what they have created of the earth. Or have they any portion in the heavens? Bring me a scripture before this (Scripture), or some vestige of knowledge (in support of what ye say), if ye are truthful.

source: ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون
en: And who is further astray than those who, instead of Allah, pray unto such as hear not their prayer until the Day of Resurrection, and are unconscious of their prayer,

source: وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين
en: And when mankind are gathered (to the Judgment) will become enemies for them, and will become deniers of having been worshipped.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للحق لما جاءهم هذا سحر مبين
en: And when Our clear revelations are recited unto them, those who disbelieve say of the Truth when it reacheth them: This is mere magic.

source: أم يقولون افتراه قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم
en: Or say they: He hath invented it? Say (O Muhammad): If I have invented it, still ye have no power to support me against Allah. He is Best Aware of what ye say among yourselves concerning it. He sufficeth for a witness between me and you. And He is the Forgiving, the Merciful.

source: قل ما كنت بدعا من الرسل وما أدري ما يفعل بي ولا بكم إن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين
en: Say: I am no new thing among the messengers (of Allah), nor know I what will be done with me or with you. I do but follow that which is inspired in me, and I am but a plain warner.

source: قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين
en: Bethink you: If it is from Allah and ye disbelieve therein, and a witness of the Children of Israel hath already testified to the like thereof and hath believed, and ye are too proud (what plight is yours)? Lo! Allah guideth not wrong-doing folk.

source: وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه وإذ لم يهتدوا به فسيقولون هذا إفك قديم
en: And those who disbelieve say of those who believe: If it had been (any) good, they would not have been before us in attaining it. And since they will not be guided by it, they say: This is an ancient lie;

source: ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسانا عربيا لينذر الذين ظلموا وبشرى للمحسنين
en: When before it there was the Scripture of Moses, an example and a mercy; and this is a confirming Scripture in the Arabic language, that it may warn those who do wrong and bring good tidings for the righteous.

source: إن الذين قالوا ربنا الله ثم استقاموا فلا خوف عليهم ولا هم يحزنون
en: Lo! those who say: Our Lord is Allah, and thereafter walk aright, there shall no fear come upon them neither shall they grieve.

source: أولئك أصحاب الجنة خالدين فيها جزاء بما كانوا يعملون
en: Such are rightful owners of the Garden, immortal therein, as a reward for what they used to do.

source: ووصينا الإنسان بوالديه إحسانا حملته أمه كرها ووضعته كرها وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين
en: And We have commended unto man kindness toward parents. His mother beareth him with reluctance, and bringeth him forth with reluctance, and the bearing of him and the weaning of him is thirty months, till, when he attaineth full strength and reacheth forty years, he saith: My Lord! Arouse me that I may give thanks for the favour wherewith Thou hast favoured me and my parents, and that I may do right acceptable unto Thee. And be gracious unto me in the matter of my seed. Lo! I have turned unto Thee repentant, and lo! I am of those who surrender (unto Thee).

source: أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون
en: Those are they from whom We accept the best of what they do, and overlook their evil deeds. (They are) among the owners of the Garden. This is the true promise which they were promised (in the world).

source: والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين
en: And whoso saith unto his parents: Fie upon you both! Do ye threaten me that I shall be brought forth (again) when generations before me have passed away? And they twain cry unto Allah for help (and say): Woe unto thee! Believe! Lo! the promise of Allah is true. But he saith: This is naught save fables of the men of old:

source: أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: Such are those on whom the Word concerning nations of the jinn and mankind which have passed away before them hath effect. Lo! they are the losers.

source: ولكل درجات مما عملوا وليوفيهم أعمالهم وهم لا يظلمون
en: And for all there will be ranks from what they do, that He may pay them for their deeds; and they will not be wronged.

source: ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون
en: And on the day when those who disbelieve are exposed to the Fire (it will be said): Ye squandered your good things in the life of the world and sought comfort therein. Now this day ye are rewarded with the doom of ignominy because ye were disdainful in the land without a right, and because ye used to transgress.

source: واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه ألا تعبدوا إلا الله إني أخاف عليكم عذاب يوم عظيم
en: And make mention (O Muhammad) of the brother of A'ad when he warned his folk among the wind-curved sandhills - and verily warners came and went before and after him - saying: Serve none but Allah. Lo! I fear for you the doom of a tremendous Day.

source: قالوا أجئتنا لتأفكنا عن آلهتنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: Hast come to turn us away from our gods? Then bring upon us that wherewith thou threatenest us, if thou art of the truthful.

source: قال إنما العلم عند الله وأبلغكم ما أرسلت به ولكني أراكم قوما تجهلون
en: He said: The knowledge is with Allah only. I convey unto you that wherewith I have been sent, but I see you are a folk that know not.

source: فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب أليم
en: Then, when they beheld it as a dense cloud coming toward their valleys, they said: Here is a cloud bringing us rain. Nay, but it is that which ye did seek to hasten, a wind wherein is painful torment,

source: تدمر كل شيء بأمر ربها فأصبحوا لا يرى إلا مساكنهم كذلك نجزي القوم المجرمين
en: Destroying all things by commandment of its Lord. And morning found them so that naught could be seen save their dwellings. Thus do We reward the guilty folk.

source: ولقد مكناهم فيما إن مكناكم فيه وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون
en: And verily We had empowered them with that wherewith We have not empowered you, and had assigned them ears and eyes and hearts; but their ears and eyes and hearts availed them naught since they denied the revelations of Allah; and what they used to mock befell them.

source: ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون
en: And verily We have destroyed townships round about you, and displayed (for them) Our revelation, that haply they might return.

source: فلولا نصرهم الذين اتخذوا من دون الله قربانا آلهة بل ضلوا عنهم وذلك إفكهم وما كانوا يفترون
en: Then why did those whom they had chosen for gods as a way of approach (unto Allah) not help them? Nay, but they did fail them utterly. And (all) that was their lie, and what they used to invent.

source: وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولوا إلى قومهم منذرين
en: And when We inclined toward thee (Muhammad) certain of the jinn, who wished to hear the Qur'an and, when they were in its presence, said: Give ear! and, when it was finished, turned back to their people, warning.

source: قالوا يا قومنا إنا سمعنا كتابا أنزل من بعد موسى مصدقا لما بين يديه يهدي إلى الحق وإلى طريق مستقيم
en: They said: O our people! Lo! we have heard a scripture which hath been revealed after Moses, confirming that which was before it, guiding unto the truth and a right road.

source: يا قومنا أجيبوا داعي الله وآمنوا به يغفر لكم من ذنوبكم ويجركم من عذاب أليم
en: O our people! respond to Allah's summoner and believe in Him. He will forgive you some of your sins and guard you from a painful doom.

source: ومن لا يجب داعي الله فليس بمعجز في الأرض وليس له من دونه أولياء أولئك في ضلال مبين
en: And whoso respondeth not to Allah's summoner he can nowise escape in the earth, and he hath no protecting friends instead of Him. Such are in error manifest.

source: أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير
en: Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead? Aye, He verily is Able to do all things.

source: ويوم يعرض الذين كفروا على النار أليس هذا بالحق قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون
en: And on the day when those who disbelieve are exposed to the Fire (they will be asked): Is not this real? They will say: Yea, by our Lord. He will say: Then taste the doom for that ye disbelieved.

source: فاصبر كما صبر أولو العزم من الرسل ولا تستعجل لهم كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار بلاغ فهل يهلك إلا القوم الفاسقون
en: Then have patience (O Muhammad) even as the stout of heart among the messengers (of old) had patience, and seek not to hasten on (the doom) for them. On the day when they see that which they are promised (it will seem to them) as though they had tarried but an hour of daylight. A clear message. Shall any be destroyed save evil-living folk?

source: الذين كفروا وصدوا عن سبيل الله أضل أعمالهم
en: Those who disbelieve and turn (men) from the way of Allah, He rendereth their actions vain.

source: والذين آمنوا وعملوا الصالحات وآمنوا بما نزل على محمد وهو الحق من ربهم كفر عنهم سيئاتهم وأصلح بالهم
en: And those who believe and do good works and believe in that which is revealed unto Muhammad - and it is the truth from their Lord - He riddeth them of their ill-deeds and improveth their state.

source: ذلك بأن الذين كفروا اتبعوا الباطل وأن الذين آمنوا اتبعوا الحق من ربهم كذلك يضرب الله للناس أمثالهم
en: That is because those who disbelieve follow falsehood and because those who believe follow the truth from their Lord. Thus Allah coineth their similitudes for mankind.

source: فإذا لقيتم الذين كفروا فضرب الرقاب حتى إذا أثخنتموهم فشدوا الوثاق فإما منا بعد وإما فداء حتى تضع الحرب أوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض والذين قتلوا في سبيل الله فلن يضل أعمالهم
en: Now when ye meet in battle those who disbelieve, then it is smiting of the necks until, when ye have routed them, then making fast of bonds; and afterward either grace or ransom till the war lay down its burdens. That (is the ordinance). And if Allah willed He could have punished them (without you) but (thus it is ordained) that He may try some of you by means of others. And those who are slain in the way of Allah, He rendereth not their actions vain.

source: سيهديهم ويصلح بالهم
en: He will guide them and improve their state,
